---
kind: property
id: P:Autodesk.Revit.DB.Visual.Ceramic.CeramicPatternMap
source: html/998f2240-cbd5-5316-a13a-03673512936d.htm
---
# Autodesk.Revit.DB.Visual.Ceramic.CeramicPatternMap Property

The property labeled "Image" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public static string CeramicPatternMap { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.